#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in HCP Terraform. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

The remote workspace is configured to work with configuration at
terraform relative to the target repository.

Terraform will upload the contents of the following directory,
excluding files or directories as defined by a .terraformignore file
at /home/runner/work/ambrosia-serve-k8s/ambrosia-serve-k8s/.terraformignore (if it is present),
in order to capture the filesystem context the remote workspace expects:
    /home/runner/work/ambrosia-serve-k8s/ambrosia-serve-k8s

To view this run in a browser, visit:
https://app.terraform.io/app/ambrosia-serve/postech-workspace/runs/run-vmpnZMFpdhDSE6ie

Waiting for the plan to start...

Terraform v1.10.1
on linux_amd64
Initializing plugins and modules...
data.aws_vpc.ambrosia_serve_vpc: Refreshing...
data.aws_vpc.ambrosia_serve_vpc: Refresh complete after 0s [id=vpc-01525f58b2e30df1b]
aws_security_group.sg: Refreshing state... [id=sg-00ed62c5d2723dfa0]
aws_lb_target_group.tg: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:851725225519:targetgroup/TG-ambrosia-serve/4ff9befd3b8e2981]
aws_vpc_security_group_ingress_rule.allow_http_ipv4_80: Refreshing state... [id=sgr-08da236a4845d2ffe]
aws_vpc_security_group_egress_rule.allow_all_traffic_ipv6: Refreshing state... [id=sgr-0ba7a282e92398a9a]
aws_vpc_security_group_egress_rule.allow_all_traffic_ipv4: Refreshing state... [id=sgr-0a8ca4f2d45007d8b]
aws_alb.alb: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:851725225519:loadbalancer/app/production-alb/0223521b238ebdeb]
aws_lb_listener.listener: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:851725225519:listener/app/production-alb/0223521b238ebdeb/efedcc1ab4bbaf1e]
aws_lb_target_group.tg: Drift detected (update)
aws_lb_listener.listener: Drift detected (update)
╷
│ Warning: Value for undeclared variable
│
│ The root module does not declare a variable named "AWS_SESSION_TOKEN" but a
│ value was found in file
│ "/home/tfc-agent/.tfc-agent/component/terraform/runs/run-vmpnZMFpdhDSE6ie/terraform.tfvars".
│ If you meant to use this value, add a "variable" block to the
│ configuration.
│
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Value for undeclared variable
│
│ The root module does not declare a variable named "AWS_ACCESS_KEY_ID" but a
│ value was found in file
│ "/home/tfc-agent/.tfc-agent/component/terraform/runs/run-vmpnZMFpdhDSE6ie/terraform.tfvars".
│ If you meant to use this value, add a "variable" block to the
│ configuration.
│
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Values for undeclared variables
│
│ In addition to the other similar warnings shown, 1 other variable(s)
│ defined without being declared.
╵

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_instance.ec2 will be read during apply
 <= data "aws_instance" "ec2" {
      + ami                         = (known after apply)
      + arn                         = (known after apply)
      + associate_public_ip_address = (known after apply)
      + availability_zone           = (known after apply)
      + credit_specification        = (known after apply)
      + disable_api_stop            = (known after apply)
      + disable_api_termination     = (known after apply)
      + ebs_block_device            = (known after apply)
      + ebs_optimized               = (known after apply)
      + enclave_options             = (known after apply)
      + ephemeral_block_device      = (known after apply)
      + host_id                     = (known after apply)
      + host_resource_group_arn     = (known after apply)
      + iam_instance_profile        = (known after apply)
      + id                          = (known after apply)
      + instance_state              = (known after apply)
      + instance_tags               = (known after apply)
      + instance_type               = (known after apply)
      + ipv6_addresses              = (known after apply)
      + key_name                    = (known after apply)
      + launch_time                 = (known after apply)
      + maintenance_options         = (known after apply)
      + metadata_options            = (known after apply)
      + monitoring                  = (known after apply)
      + network_interface_id        = (known after apply)
      + outpost_arn                 = (known after apply)
      + password_data               = (known after apply)
      + placement_group             = (known after apply)
      + placement_partition_number  = (known after apply)
      + private_dns                 = (known after apply)
      + private_dns_name_options    = (known after apply)
      + private_ip                  = (known after apply)
      + public_dns                  = (known after apply)
      + public_ip                   = (known after apply)
      + root_block_device           = (known after apply)
      + secondary_private_ips       = (known after apply)
      + security_groups             = (known after apply)
      + source_dest_check           = (known after apply)
      + subnet_id                   = (known after apply)
      + tags                        = (known after apply)
      + tenancy                     = (known after apply)
      + user_data                   = (known after apply)
      + user_data_base64            = (known after apply)
      + vpc_security_group_ids      = (known after apply)

      + filter {
          + name   = "tag:eks:nodegroup-name"
          + values = [
              + "ambrosia-serve",
            ]
        }
    }

  # aws_eks_access_entry.eks_access_entry will be created
  + resource "aws_eks_access_entry" "eks_access_entry" {
      + access_entry_arn  = (known after apply)
      + cluster_name      = "ambrosia-serve-cluster"
      + created_at        = (known after apply)
      + id                = (known after apply)
      + kubernetes_groups = [
          + "ambrosia-serve",
        ]
      + modified_at       = (known after apply)
      + principal_arn     = "arn:aws:iam::851725225519:role/voclabs"
      + tags_all          = {
          + "Environment" = "Production"
          + "Owner"       = "Grupo-40"
          + "Project"     = "Ambrosia Serve"
        }
      + type              = "STANDARD"
      + user_name         = (known after apply)
    }

  # aws_eks_access_policy_association.voclabs_access_policy_association will be created
  + resource "aws_eks_access_policy_association" "voclabs_access_policy_association" {
      + associated_at = (known after apply)
      + cluster_name  = "ambrosia-serve-cluster"
      + id            = (known after apply)
      + modified_at   = (known after apply)
      + policy_arn    = "arn:aws:eks::aws:cluster-access-policy/AmazonEKSClusterAdminPolicy"
      + principal_arn = "arn:aws:iam::851725225519:role/voclabs"

      + access_scope {
          + type = "cluster"
        }
    }

  # aws_eks_cluster.cluster will be created
  + resource "aws_eks_cluster" "cluster" {
      + arn                           = (known after apply)
      + bootstrap_self_managed_addons = true
      + certificate_authority         = (known after apply)
      + cluster_id                    = (known after apply)
      + created_at                    = (known after apply)
      + endpoint                      = (known after apply)
      + id                            = (known after apply)
      + identity                      = (known after apply)
      + name                          = "ambrosia-serve-cluster"
      + platform_version              = (known after apply)
      + role_arn                      = "arn:aws:iam::851725225519:role/LabRole"
      + status                        = (known after apply)
      + tags_all                      = {
          + "Environment" = "Production"
          + "Owner"       = "Grupo-40"
          + "Project"     = "Ambrosia Serve"
        }
      + version                       = "1.31"

      + access_config {
          + authentication_mode = "API_AND_CONFIG_MAP"
        }

      + kubernetes_network_config (known after apply)

      + upgrade_policy (known after apply)

      + vpc_config {
          + cluster_security_group_id = (known after apply)
          + endpoint_private_access   = false
          + endpoint_public_access    = true
          + public_access_cidrs       = (known after apply)
          + security_group_ids        = [
              + "sg-00ed62c5d2723dfa0",
            ]
          + subnet_ids                = [
              + "\t",
              + "subnet-07a2bee2a3e08594e",
            ]
          + vpc_id                    = (known after apply)
        }
    }

  # aws_eks_node_group.node_group will be created
  + resource "aws_eks_node_group" "node_group" {
      + ami_type               = (known after apply)
      + arn                    = (known after apply)
      + capacity_type          = (known after apply)
      + cluster_name           = "ambrosia-serve-cluster"
      + disk_size              = (known after apply)
      + id                     = (known after apply)
      + instance_types         = (known after apply)
      + node_group_name        = "ambrosia-serve"
      + node_group_name_prefix = (known after apply)
      + node_role_arn          = "arn:aws:iam::851725225519:role/LabRole"
      + release_version        = (known after apply)
      + resources              = (known after apply)
      + status                 = (known after apply)
      + subnet_ids             = [
          + "subnet-07a2bee2a3e08594e",
          + "subnet-0bb9852652d96a262",
        ]
      + tags_all               = {
          + "Environment" = "Production"
          + "Owner"       = "Grupo-40"
          + "Project"     = "Ambrosia Serve"
        }
      + version                = (known after apply)

      + scaling_config {
          + desired_size = 1
          + max_size     = 2
          + min_size     = 1
        }

      + update_config {
          + max_unavailable = 1
        }
    }

  # aws_lb_target_group_attachment.attach will be created
  + resource "aws_lb_target_group_attachment" "attach" {
      + id               = (known after apply)
      + port             = 80
      + target_group_arn = "arn:aws:elasticloadbalancing:us-east-1:851725225519:targetgroup/TG-ambrosia-serve/4ff9befd3b8e2981"
      + target_id        = (known after apply)
    }

Plan: 5 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + cluster_endpoint  = (known after apply)
  + cluster_name      = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @felixrodrigo19, Action: `pull_request`, Working Directory: ``, Workflow: `CI - Infra`*